app/Models/BerandaModel.php

    public function reportTransaksi($tahun)
    {
        return $this->db->table('detail_penjualan as dp')
            ->select('MONTH(p.created_at) month, SUM(dp.total_harga) total')
            ->join('penjualan p', 'Id_Penjualan')
            ->where('YEAR(p.created_at)', $tahun)
            ->orderBy('MONTH(p.created_at)')
            ->get()->getResultArray();
---
SELECT MONTH(p.created_at) month, SUM(dp.total_harga) total
FROM `detail_penjualan` as `dp`
JOIN `penjualan` `p` USING (`Id_Penjualan`)
WHERE YEAR(p.created_at) = '2023'
ORDER BY MONTH(p.created_at)

    public function reportPembelian($tahun)
    {
        return $this->db->table('detail_pembelian as dp')
            ->select('MONTH(p.created_at) month, SUM(dp.total_harga) total')
            ->join('pembelian p', 'Id_Pembelian')
            ->where('YEAR(p.created_at)', $tahun)
            ->groupBy('MONTH(p.created_at)')
            ->orderBy('MONTH(p.created_at)')
            ->get()->getResultArray();
---
SELECT MONTH(p.created_at) month, SUM(dp.total_harga) total
FROM `detail_pembelian` as `dp`
JOIN `pembelian` `p` USING (`Id_Pembelian`)
WHERE YEAR(p.created_at) = '2023'
GROUP BY MONTH(p.created_at)
ORDER BY MONTH(p.created_at)

    public function reportPelanggan($tahun)
    {
        return $this->db->table('pelanggan')
            ->select('MONTH(created_at) month, Count(*) total')
            ->where('YEAR(created_at)', $tahun)
            ->groupBy('MONTH(created_at)')
            ->orderBy('MONTH(created_at)')
            ->get()->getResultArray();
---
SELECT MONTH(created_at) month, Count(*) total
FROM `pelanggan`
WHERE YEAR(created_at) = '2023'
GROUP BY MONTH(created_at)
ORDER BY MONTH(created_at)