app/Models/PembelianModel.php

    public function getReport($tgl_awal, $tgl_akhir)
    {
        return $this->db->table('detail_pembelian as dp')
            ->select('p.Id_Pembelian, p.created_at tgl_transaksi, us.id user_id, us.firstname,
        us.lastname, , us.user_name, st.Nama_Barang,
        SUM(dp.total_harga) total')
            ->join('pembelian p', 'Id_Pembelian')
            ->join('role us', 'us.Id = p.Id_Role')
            ->join('stok st', 'st.Id_Barang = dp.Id_Barang')
            ->where('date(p.created_at) >=', $tgl_awal)
            ->where('date(p.created_at) <=', $tgl_akhir)
            ->groupBy('p.Id_Pembelian')
            ->get()->getResultArray();
---
SELECT `p`.`Id_Pembelian`, `p`.`created_at` `tgl_transaksi`, `us`.`id` `user_id`, `us`.`firstname`, `us`.`lastname`, `us`.`user_name`, `st`.`Nama_Barang`, SUM(dp.total_harga) total
FROM `detail_pembelian` as `dp`
JOIN `pembelian` `p` USING (`Id_Pembelian`)
JOIN `role` `us` ON `us`.`Id` = `p`.`Id_Role`
JOIN `stok` `st` ON `st`.`Id_Barang` = `dp`.`Id_Barang`
WHERE date(p.created_at) >= '2023-12-01'
AND date(p.created_at) <= '2023-12-31'
GROUP BY `p`.`Id_Pembelian`