app/Models/StokModel.php

    public function getStok($id = false)
    {
        $query = $this->select('*');

        if ($id == false) {
            return $query->findAll();
        } else {
            return $query->where(['Id_Barang' => $id])->first();
---
SELECT *
FROM `stok`
WHERE `stok`.`deleted_at` IS NULL
SELECT *
FROM `stok`
WHERE `Id_Barang` = '34'
AND `stok`.`deleted_at` IS NULL
 LIMIT 1